Revit 2027 API
DocumentPrintedEventArgs Class
 The event arguments used by the DocumentPrinted event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.DocumentPrintedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentPrintedEventArgs : RevitAPIPostDocEventArgs
Public Class DocumentPrintedEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class DocumentPrintedEventArgs : public RevitAPIPostDocEventArgs
type DocumentPrintedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The DocumentPrintedEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
Document |  The document associated with the event.
(Inherited from RevitAPIPostDocEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Status |  Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
(Inherited from RevitAPIPostEventArgs)
Top
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFailedViewElementIds |  Returns ElementIds of the views that that failed to print (if any).
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetPrintedViewElementIds |  Returns ElementIds of the views that printed successfully.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace